STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235fxx_cm33.h
#define HDP                         HDP_NS
#define HDP_BASE                    HDP_BASE_NS

/*!< AHB4 peripherals defaults to Non secure aliases */
#define RCC                         RCC_NS
#define RCC_BASE                    RCC_BASE_NS

#define PWR                         PWR_NS
#define PWR_BASE                    PWR_BASE_NS

#define EXTI1                       EXTI1_NS
#define EXTI1_BASE                  EXTI1_BASE_NS

#define EXTI1_C1                    EXTI1_C1_NS
#define EXTI1_C1_BASE               EXTI1_C1_BASE_NS

#define EXTI1_C2                    EXTI1_C2_NS
#define EXTI1_C2_BASE               EXTI1_C2_BASE_NS

#define SYSCFG                      SYSCFG_NS
#define SYSCFG_BASE                 SYSCFG_BASE_NS

#define GPIOA                       GPIOA_NS
#define GPIOA_BASE                  GPIOA_BASE_NS

#define GPIOB                       GPIOB_NS
#define GPIOB_BASE                  GPIOB_BASE_NS

#define GPIOC                       GPIOC_NS
#define GPIOC_BASE                  GPIOC_BASE_NS

#define GPIOD                       GPIOD_NS
#define GPIOD_BASE                  GPIOD_BASE_NS

#define GPIOE                       GPIOE_NS
#define GPIOE_BASE                  GPIOE_BASE_NS

#define GPIOF                       GPIOF_NS
#define GPIOF_BASE                  GPIOF_BASE_NS

#define GPIOG                       GPIOG_NS
#define GPIOG_BASE                  GPIOG_BASE_NS

#define GPIOH                       GPIOH_NS
#define GPIOH_BASE                  GPIOH_BASE_NS

#define GPIOI                       GPIOI_NS
#define GPIOI_BASE                  GPIOI_BASE_NS

#define GPIOJ                       GPIOJ_NS
#define GPIOJ_BASE                  GPIOJ_BASE_NS

#define GPIOK                       GPIOK_NS
#define GPIOK_BASE                  GPIOK_BASE_NS

/*!< SMART_RUN_APB peripherals defaults to Non secure aliases */
#define RTC                         RTC_NS
#define RTC_BASE                    RTC_BASE_NS

#define TAMP                        TAMP_NS
#define TAMP_BASE                   TAMP_BASE_NS

#define SPI8                        SPI8_NS
#define SPI8_BASE                   SPI8_BASE_NS

#define LPUART1                     LPUART1_NS
#define LPUART1_BASE                LPUART1_BASE_NS

#define I2C8                        I2C8_NS
#define I2C8_BASE                   I2C8_BASE_NS

#define LPTIM3                      LPTIM3_NS
#define LPTIM3_BASE                 LPTIM3_BASE_NS

#define LPTIM4                      LPTIM4_NS
#define LPTIM4_BASE                 LPTIM4_BASE_NS

#define LPTIM5                      LPTIM5_NS
#define LPTIM5_BASE                 LPTIM5_BASE_NS

#define I3C4                        I3C4_NS
#define I3C4_BASE                   I3C4_BASE_NS

#define IWDG5                       IWDG5_NS
#define IWDG5_BASE                  IWDG5_BASE_NS

#define WWDG2                       WWDG2_NS
#define WWDG2_BASE                  WWDG2_BASE_NS

/*!< SMART_RUN_AHB peripherals defaults to Non secure aliases */
#define GPIOZ                       GPIOZ_NS
#define GPIOZ_BASE                  GPIOZ_BASE_NS

#define LPDMA                       LPDMA_NS
#define LPDMA_BASE                  LPDMA_BASE_NS


#define EXTI2                       EXTI2_NS
#define EXTI2_BASE                  EXTI2_BASE_NS

#define EXTI2_C1                    EXTI2_C1_NS
#define EXTI2_C1_BASE               EXTI2_C1_BASE_NS

#define EXTI2_C2                    EXTI2_C2_NS
#define EXTI2_C2_BASE               EXTI2_C2_BASE_NS

#define EXTI2_C3                    EXTI2_C3_NS
#define EXTI2_C3_BASE               EXTI2_C3_BASE_NS

#define HSEM                        HSEM_NS
#define HSEM_BASE                   HSEM_BASE_NS
#define HSEM_COMMON                 HSEM_COMMON_NS

#define IPCC2                       IPCC2_NS
#define IPCC2_BASE                  IPCC2_BASE_NS

#define IPCC2_C1                    IPCC2_C1_NS
#define IPCC2_C1_BASE               IPCC2_C1_BASE_NS

#define IPCC2_C2                    IPCC2_C2_NS
#define IPCC2_C2_BASE               IPCC2_C2_BASE_NS

#define LPDMA_Channel0              LPDMA_Channel0_NS
#define LPDMA_Channel0_BASE         LPDMA_Channel0_BASE_NS

#define LPDMA_Channel1              LPDMA_Channel1_NS
#define LPDMA_Channel1_BASE         LPDMA_Channel1_BASE_NS

#define LPDMA_Channel2              LPDMA_Channel2_NS
#define LPDMA_Channel2_BASE         LPDMA_Channel2_BASE_NS

#define LPDMA_Channel3              LPDMA_Channel3_NS
#define LPDMA_Channel3_BASE         LPDMA_Channel3_BASE_NS

#define DSI                         DSI_NS
#define DSI_BASE                    DSI_BASE_NS

#define LTDC                        LTDC_NS
#define LTDC_BASE                   LTDC_BASE_NS

#define LTDC_Layer1                 LTDC_Layer1_NS
#define LTDC_Layer1_BASE            LTDC_Layer1_BASE_NS

#define LTDC_Layer2                 LTDC_Layer2_NS
#define LTDC_Layer2_BASE            LTDC_Layer2_BASE_NS

#define LTDC_Layer3                 LTDC_Layer3_NS
#define LTDC_Layer3_BASE            LTDC_Layer3_BASE_NS

#define CSI                         CSI_NS
#define CSI_BASE                    CSI_BASE_NS

#define DCMIPP                      DCMIPP_NS
#define DCMIPP_BASE                 DCMIPP_BASE_NS

#define DDRC                        DDRC_NS
#define DDRC_BASE                   DDRC_BASE_NS

#define DDRDBG                      DDRDBG_NS
#define DDRDBG_BASE                 DDRDBG_BASE_NS
#define LVDS                        LVDS_NS
#define LVDS_BASE                   LVDS_BASE_NS
#define STGENR                      STGENR_NS
#define STGENR_BASE                 STGENR_BASE_NS

#define STGENC                      STGENC_NS
#define STGENC_BASE                 STGENC_BASE_NS

#define GICV2M                      GICV2M_NS
#define GICV2M_BASE                 GICV2M_BASE_NS

#define UCPD1                       UCPD1_NS
#define UCPD1_BASE                  UCPD1_BASE_NS

#define USB3PCIEPHY                 USB3PCIEPHY_NS
#define USB3PCIEPHY_BASE            USB3PCIEPHY_BASE_NS
#define VDEC                        VDEC_NS
#define VDEC_BASE                   VDEC_BASE_NS

/*!< FMC Banks registers defaults to Non secure aliases */
#define FMC_Bank1_R                 FMC_Bank1_R_NS
#define FMC_Bank1_R_BASE            FMC_Bank1_R_BASE_NS

#define FMC_Bank1E_R                FMC_Bank1E_R_NS
#define FMC_Bank1E_R_BASE           FMC_Bank1E_R_BASE_NS

#define FMC_Bank3_R                 FMC_Bank3_R_NS
#define FMC_Bank3_R_BASE            FMC_Bank3_R_BASE_NS

