STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235fxx_cm33.h
/****************  Bit definition for DDRC_PWRCTL register  ****************/
#define DDRC_PWRCTL_SELFREF_EN_Pos              (0U)
#define DDRC_PWRCTL_SELFREF_EN_Msk              (0x1UL << DDRC_PWRCTL_SELFREF_EN_Pos)              /*!< 0x00000001 */
#define DDRC_PWRCTL_SELFREF_EN                  DDRC_PWRCTL_SELFREF_EN_Msk                        /*!< If true then the DDRC puts the SDRAM into Self Refresh after a programmable number of cycles "maximum idle clocks before Self Refresh (PWRTMG.selfref_to_x32)". This register bit may be re-programmed during the course of normal operation. */
#define DDRC_PWRCTL_POWERDOWN_EN_Pos            (1U)
#define DDRC_PWRCTL_POWERDOWN_EN_Msk            (0x1UL << DDRC_PWRCTL_POWERDOWN_EN_Pos)            /*!< 0x00000002 */
#define DDRC_PWRCTL_POWERDOWN_EN                DDRC_PWRCTL_POWERDOWN_EN_Msk                      /*!< If true then the DDRC goes into power-down after a programmable number of cycles "maximum idle clocks before power down" (PWRTMG.powerdown_to_x32). */
#define DDRC_PWRCTL_EN_DFI_DRAM_CLK_DISABLE_Pos (3U)
#define DDRC_PWRCTL_EN_DFI_DRAM_CLK_DISABLE_Msk (0x1UL << DDRC_PWRCTL_EN_DFI_DRAM_CLK_DISABLE_Pos) /*!< 0x00000008 */
#define DDRC_PWRCTL_EN_DFI_DRAM_CLK_DISABLE     DDRC_PWRCTL_EN_DFI_DRAM_CLK_DISABLE_Msk           /*!< Enable the assertion of dfi_dram_clk_disable whenever a clock is not required by the SDRAM. */
#define DDRC_PWRCTL_SELFREF_SW_Pos              (5U)
#define DDRC_PWRCTL_SELFREF_SW_Msk              (0x1UL << DDRC_PWRCTL_SELFREF_SW_Pos)              /*!< 0x00000020 */
#define DDRC_PWRCTL_SELFREF_SW                  DDRC_PWRCTL_SELFREF_SW_Msk                        /*!< A value of 1 to this register causes system to move to Self Refresh state immediately, as long as it is not in INIT or DPD/MPSM operating_mode. This is referred to as Software Entry/Exit to Self Refresh. */
#define DDRC_PWRCTL_STAY_IN_SELFREF_Pos         (6U)
#define DDRC_PWRCTL_STAY_IN_SELFREF_Msk         (0x1UL << DDRC_PWRCTL_STAY_IN_SELFREF_Pos)         /*!< 0x00000040 */
#define DDRC_PWRCTL_STAY_IN_SELFREF             DDRC_PWRCTL_STAY_IN_SELFREF_Msk                   /*!< SR state transition. SR is an intermediate state to enter/exit SRPD state for LPDDR4. This bit controls transition from SR state. */

/****************  Bit definition for DDRC_PWRTMG register  ****************/
#define DDRC_PWRTMG_SELFREF_TO_X32_Pos   (16U)
#define DDRC_PWRTMG_SELFREF_TO_X32_Msk   (0xFFUL << DDRC_PWRTMG_SELFREF_TO_X32_Pos)   /*!< 0x00FF0000 */
#define DDRC_PWRTMG_SELFREF_TO_X32       DDRC_PWRTMG_SELFREF_TO_X32_Msk              /*!< After this many clocks of the DDRC command channel being idle the DDRC automatically puts the SDRAM into Self Refresh. The DDRC command channel is considered idle when there are no HIF commands outstanding. This must be enabled in the PWRCTL.selfref_en. */
#define DDRC_PWRTMG_SELFREF_TO_X32_0     (0x1UL << DDRC_PWRTMG_SELFREF_TO_X32_Pos)    /*!< 0x00010000 */
#define DDRC_PWRTMG_SELFREF_TO_X32_1     (0x2UL << DDRC_PWRTMG_SELFREF_TO_X32_Pos)    /*!< 0x00020000 */
#define DDRC_PWRTMG_SELFREF_TO_X32_2     (0x4UL << DDRC_PWRTMG_SELFREF_TO_X32_Pos)    /*!< 0x00040000 */
#define DDRC_PWRTMG_SELFREF_TO_X32_3     (0x8UL << DDRC_PWRTMG_SELFREF_TO_X32_Pos)    /*!< 0x00080000 */
#define DDRC_PWRTMG_SELFREF_TO_X32_4     (0x10UL << DDRC_PWRTMG_SELFREF_TO_X32_Pos)   /*!< 0x00100000 */
#define DDRC_PWRTMG_SELFREF_TO_X32_5     (0x20UL << DDRC_PWRTMG_SELFREF_TO_X32_Pos)   /*!< 0x00200000 */
#define DDRC_PWRTMG_SELFREF_TO_X32_6     (0x40UL << DDRC_PWRTMG_SELFREF_TO_X32_Pos)   /*!< 0x00400000 */
#define DDRC_PWRTMG_SELFREF_TO_X32_7     (0x80UL << DDRC_PWRTMG_SELFREF_TO_X32_Pos)   /*!< 0x00800000 */

/***************  Bit definition for DDRC_HWLPCTL register  ****************/
#define DDRC_HWLPCTL_HW_LP_EN_Pos           (0U)
#define DDRC_HWLPCTL_HW_LP_EN_Msk           (0x1UL << DDRC_HWLPCTL_HW_LP_EN_Pos)           /*!< 0x00000001 */
#define DDRC_HWLPCTL_HW_LP_EN               DDRC_HWLPCTL_HW_LP_EN_Msk                     /*!< Enable for hardware low power interface. */
#define DDRC_HWLPCTL_HW_LP_EXIT_IDLE_EN_Pos (1U)
#define DDRC_HWLPCTL_HW_LP_EXIT_IDLE_EN_Msk (0x1UL << DDRC_HWLPCTL_HW_LP_EXIT_IDLE_EN_Pos)           /*!< 0x00000001 */
#define DDRC_HWLPCTL_HW_LP_EXIT_IDLE_EN     DDRC_HWLPCTL_HW_LP_EXIT_IDLE_EN_Msk                     /*!< Enable for hardware low power interface. */
#define DDRC_HWLPCTL_HW_LP_IDLE_X32_Pos     (16U)
#define DDRC_HWLPCTL_HW_LP_IDLE_X32_Msk     (0x3FFUL << DDRC_HWLPCTL_HW_LP_IDLE_X32_Pos)           /*!< 0x00000001 */
#define DDRC_HWLPCTL_HW_LP_IDLE_X32         DDRC_HWLPCTL_HW_LP_IDLE_X32_Msk                     /*!< Enable for hardware low power interface. */

/***************  Bit definition for DDRC_RFSHCTL3 register  ***************/
#define DDRC_RFSHCTL3_DIS_AUTO_REFRESH_Pos     (0U)
#define DDRC_RFSHCTL3_DIS_AUTO_REFRESH_Msk     (0x1UL << DDRC_RFSHCTL3_DIS_AUTO_REFRESH_Pos)     /*!< 0x00000001 */
#define DDRC_RFSHCTL3_DIS_AUTO_REFRESH         DDRC_RFSHCTL3_DIS_AUTO_REFRESH_Msk               /*!< When \q1\q, disable auto-refresh generated by the DDRC. When auto-refresh is disabled, the SoC core must generate refreshes using the registers DBGCMD.rankn_refresh. */
#define DDRC_RFSHCTL3_REFRESH_UPDATE_LEVEL_Pos (1U)
#define DDRC_RFSHCTL3_REFRESH_UPDATE_LEVEL_Msk (0x1UL << DDRC_RFSHCTL3_REFRESH_UPDATE_LEVEL_Pos) /*!< 0x00000002 */
#define DDRC_RFSHCTL3_REFRESH_UPDATE_LEVEL     DDRC_RFSHCTL3_REFRESH_UPDATE_LEVEL_Msk           /*!< Toggles this signal (either from 0 to 1 or from 1 to 0) to indicate that the refresh register(s) have been updated. */

/***************  Bit definition for DDRC_RFSHTMG register  ****************/
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos (16U)
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Msk (0xFFFUL << DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos) /*!< 0x0FFF0000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32     DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Msk             /*!< tREFI: Average time interval between refreshes per rank (Specification: 7.8us for DDR2, DDR3 and DDR4. See JEDEC specification for mDDR, LPDDR2, LPDDR3 and LPDDR4). */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_0   (0x1UL << DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos)   /*!< 0x00010000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_1   (0x2UL << DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos)   /*!< 0x00020000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_2   (0x4UL << DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos)   /*!< 0x00040000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_3   (0x8UL << DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos)   /*!< 0x00080000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_4   (0x10UL << DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos)  /*!< 0x00100000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_5   (0x20UL << DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos)  /*!< 0x00200000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_6   (0x40UL << DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos)  /*!< 0x00400000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_7   (0x80UL << DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos)  /*!< 0x00800000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_8   (0x100UL << DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos) /*!< 0x01000000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_9   (0x200UL << DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos) /*!< 0x02000000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_10  (0x400UL << DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos) /*!< 0x04000000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_X32_11  (0x800UL << DDRC_RFSHTMG_T_RFC_NOM_X1_X32_Pos) /*!< 0x08000000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_SEL_Pos (31U)
#define DDRC_RFSHTMG_T_RFC_NOM_X1_SEL_Msk (0x1UL << DDRC_RFSHTMG_T_RFC_NOM_X1_SEL_Pos)  /*!< 0x80000000 */
#define DDRC_RFSHTMG_T_RFC_NOM_X1_SEL     DDRC_RFSHTMG_T_RFC_NOM_X1_SEL_Msk         /*!< Specifies whether the t_rfc_nom_x1_x32 register value is x1 or x32. */

/****************  Bit definition for DDRC_INIT0 register  *****************/
#define DDRC_INIT0_SKIP_DRAM_INIT_Pos (30U)
#define DDRC_INIT0_SKIP_DRAM_INIT_Msk (0x3UL << DDRC_INIT0_SKIP_DRAM_INIT_Pos)   /*!< 0xC0000000 */
#define DDRC_INIT0_SKIP_DRAM_INIT     DDRC_INIT0_SKIP_DRAM_INIT_Msk             /*!< If lower bit is enabled the SDRAM initialization routine is skipped. The upper bit decides what state the controller starts up in when reset is removed */
#define DDRC_INIT0_SKIP_DRAM_INIT_0   (0x1UL << DDRC_INIT0_SKIP_DRAM_INIT_Pos)   /*!< 0x40000000 */
#define DDRC_INIT0_SKIP_DRAM_INIT_1   (0x2UL << DDRC_INIT0_SKIP_DRAM_INIT_Pos)   /*!< 0x80000000 */

/***************  Bit definition for DDRC_DFILPCFG0 register  ****************/
#define DDRC_DFILPCFG0_DFI_LP_EN_SR_Pos (8U)
#define DDRC_DFILPCFG0_DFI_LP_EN_SR_Msk (0x1UL << DDRC_DFILPCFG0_DFI_LP_EN_SR_Pos) /*!< 0x00000100 */
#define DDRC_DFILPCFG0_DFI_LP_EN_SR     DDRC_DFILPCFG0_DFI_LP_EN_SR_Msk           /*!< DFI low-power interface handshaking during SR entry/exit. */

