STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235fxx_cm33.h
/*******************  Bits definition for IAC_ICR4 register *******************/
#define IAC_ICR4_IAF128_Pos           (0U)
#define IAC_ICR4_IAF128_Msk           (0x1UL << IAC_ICR4_IAF128_Pos)             /*!< 0x00000001 */
#define IAC_ICR4_IAF128               IAC_ICR4_IAF128_Msk
#define IAC_ICR4_IAF129_Pos           (1U)
#define IAC_ICR4_IAF129_Msk           (0x1UL << IAC_ICR4_IAF129_Pos)             /*!< 0x00000002 */
#define IAC_ICR4_IAF129               IAC_ICR4_IAF129_Msk
#define IAC_ICR4_IAF130_Pos           (2U)
#define IAC_ICR4_IAF130_Msk           (0x1UL << IAC_ICR4_IAF130_Pos)             /*!< 0x00000004 */
#define IAC_ICR4_IAF130               IAC_ICR4_IAF130_Msk
#define IAC_ICR4_IAF131_Pos           (3U)
#define IAC_ICR4_IAF131_Msk           (0x1UL << IAC_ICR4_IAF131_Pos)             /*!< 0x00000008 */
#define IAC_ICR4_IAF131               IAC_ICR4_IAF131_Msk
#define IAC_ICR4_IAF132_Pos           (4U)
#define IAC_ICR4_IAF132_Msk           (0x1UL << IAC_ICR4_IAF132_Pos)             /*!< 0x00000010 */
#define IAC_ICR4_IAF132               IAC_ICR4_IAF132_Msk
#define IAC_ICR4_IAF133_Pos           (5U)
#define IAC_ICR4_IAF133_Msk           (0x1UL << IAC_ICR4_IAF133_Pos)             /*!< 0x00000020 */
#define IAC_ICR4_IAF133               IAC_ICR4_IAF133_Msk
#define IAC_ICR4_IAF134_Pos           (6U)
#define IAC_ICR4_IAF134_Msk           (0x1UL << IAC_ICR4_IAF134_Pos)             /*!< 0x00000040 */
#define IAC_ICR4_IAF134               IAC_ICR4_IAF134_Msk
#define IAC_ICR4_IAF135_Pos           (7U)
#define IAC_ICR4_IAF135_Msk           (0x1UL << IAC_ICR4_IAF135_Pos)             /*!< 0x00000080 */
#define IAC_ICR4_IAF135               IAC_ICR4_IAF135_Msk
#define IAC_ICR4_IAF136_Pos           (8U)
#define IAC_ICR4_IAF136_Msk           (0x1UL << IAC_ICR4_IAF136_Pos)             /*!< 0x00000100 */
#define IAC_ICR4_IAF136               IAC_ICR4_IAF136_Msk
#define IAC_ICR4_IAF137_Pos           (9U)
#define IAC_ICR4_IAF137_Msk           (0x1UL << IAC_ICR4_IAF137_Pos)             /*!< 0x00000200 */
#define IAC_ICR4_IAF137               IAC_ICR4_IAF137_Msk
#define IAC_ICR4_IAF138_Pos           (10U)
#define IAC_ICR4_IAF138_Msk           (0x1UL << IAC_ICR4_IAF138_Pos)             /*!< 0x00000400 */
#define IAC_ICR4_IAF138               IAC_ICR4_IAF138_Msk
#define IAC_ICR4_IAF139_Pos           (11U)
#define IAC_ICR4_IAF139_Msk           (0x1UL << IAC_ICR4_IAF139_Pos)             /*!< 0x00000800 */
#define IAC_ICR4_IAF139               IAC_ICR4_IAF139_Msk
#define IAC_ICR4_IAF140_Pos           (12U)
#define IAC_ICR4_IAF140_Msk           (0x1UL << IAC_ICR4_IAF140_Pos)             /*!< 0x00001000 */
#define IAC_ICR4_IAF140               IAC_ICR4_IAF140_Msk
#define IAC_ICR4_IAF141_Pos           (13U)
#define IAC_ICR4_IAF141_Msk           (0x1UL << IAC_ICR4_IAF141_Pos)             /*!< 0x00002000 */
#define IAC_ICR4_IAF141               IAC_ICR4_IAF141_Msk
#define IAC_ICR4_IAF142_Pos           (14U)
#define IAC_ICR4_IAF142_Msk           (0x1UL << IAC_ICR4_IAF142_Pos)             /*!< 0x00004000 */
#define IAC_ICR4_IAF142               IAC_ICR4_IAF142_Msk
#define IAC_ICR4_IAF143_Pos           (15U)
#define IAC_ICR4_IAF143_Msk           (0x1UL << IAC_ICR4_IAF143_Pos)             /*!< 0x00008000 */
#define IAC_ICR4_IAF143               IAC_ICR4_IAF143_Msk
#define IAC_ICR4_IAF144_Pos           (16U)
#define IAC_ICR4_IAF144_Msk           (0x1UL << IAC_ICR4_IAF144_Pos)             /*!< 0x00010000 */
#define IAC_ICR4_IAF144               IAC_ICR4_IAF144_Msk
#define IAC_ICR4_IAF145_Pos           (17U)
#define IAC_ICR4_IAF145_Msk           (0x1UL << IAC_ICR4_IAF145_Pos)             /*!< 0x00020000 */
#define IAC_ICR4_IAF145               IAC_ICR4_IAF145_Msk
#define IAC_ICR4_IAF146_Pos           (18U)
#define IAC_ICR4_IAF146_Msk           (0x1UL << IAC_ICR4_IAF146_Pos)             /*!< 0x00040000 */
#define IAC_ICR4_IAF146               IAC_ICR4_IAF146_Msk
#define IAC_ICR4_IAF147_Pos           (19U)
#define IAC_ICR4_IAF147_Msk           (0x1UL << IAC_ICR4_IAF147_Pos)             /*!< 0x00080000 */
#define IAC_ICR4_IAF147               IAC_ICR4_IAF147_Msk
#define IAC_ICR4_IAF148_Pos           (20U)
#define IAC_ICR4_IAF148_Msk           (0x1UL << IAC_ICR4_IAF148_Pos)             /*!< 0x00100000 */
#define IAC_ICR4_IAF148               IAC_ICR4_IAF148_Msk
#define IAC_ICR4_IAF149_Pos           (21U)
#define IAC_ICR4_IAF149_Msk           (0x1UL << IAC_ICR4_IAF149_Pos)             /*!< 0x00200000 */
#define IAC_ICR4_IAF149               IAC_ICR4_IAF149_Msk
#define IAC_ICR4_IAF150_Pos           (22U)
#define IAC_ICR4_IAF150_Msk           (0x1UL << IAC_ICR4_IAF150_Pos)             /*!< 0x00400000 */
#define IAC_ICR4_IAF150               IAC_ICR4_IAF150_Msk
#define IAC_ICR4_IAF151_Pos           (23U)
#define IAC_ICR4_IAF151_Msk           (0x1UL << IAC_ICR4_IAF151_Pos)             /*!< 0x00800000 */
#define IAC_ICR4_IAF151               IAC_ICR4_IAF151_Msk
#define IAC_ICR4_IAF152_Pos           (24U)
#define IAC_ICR4_IAF152_Msk           (0x1UL << IAC_ICR4_IAF152_Pos)             /*!< 0x01000000 */
#define IAC_ICR4_IAF152               IAC_ICR4_IAF152_Msk
#define IAC_ICR4_IAF153_Pos           (25U)
#define IAC_ICR4_IAF153_Msk           (0x1UL << IAC_ICR4_IAF153_Pos)             /*!< 0x02000000 */
#define IAC_ICR4_IAF153               IAC_ICR4_IAF153_Msk
#define IAC_ICR4_IAF154_Pos           (26U)
#define IAC_ICR4_IAF154_Msk           (0x1UL << IAC_ICR4_IAF154_Pos)             /*!< 0x04000000 */
#define IAC_ICR4_IAF154               IAC_ICR4_IAF154_Msk
#define IAC_ICR4_IAF155_Pos           (27U)
#define IAC_ICR4_IAF155_Msk           (0x1UL << IAC_ICR4_IAF155_Pos)             /*!< 0x08000000 */
#define IAC_ICR4_IAF155               IAC_ICR4_IAF155_Msk
#define IAC_ICR4_IAF156_Pos           (28U)
#define IAC_ICR4_IAF156_Msk           (0x1UL << IAC_ICR4_IAF156_Pos)             /*!< 0x10000000 */
#define IAC_ICR4_IAF156               IAC_ICR4_IAF156_Msk
#define IAC_ICR4_IAF157_Pos           (29U)
#define IAC_ICR4_IAF157_Msk           (0x1UL << IAC_ICR4_IAF157_Pos)             /*!< 0x20000000 */
#define IAC_ICR4_IAF157               IAC_ICR4_IAF157_Msk
#define IAC_ICR4_IAF158_Pos           (30U)
#define IAC_ICR4_IAF158_Msk           (0x1UL << IAC_ICR4_IAF158_Pos)             /*!< 0x40000000 */
#define IAC_ICR4_IAF158               IAC_ICR4_IAF158_Msk
#define IAC_ICR4_IAF159_Pos           (31U)
#define IAC_ICR4_IAF159_Msk           (0x1UL << IAC_ICR4_IAF159_Pos)             /*!< 0x80000000 */
#define IAC_ICR4_IAF159               IAC_ICR4_IAF159_Msk

