STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235fxx_cm33.h
/**************  Bit definition for SYSCFG_COMBOPHYCR5 register  **************/
#define SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_TX_DEEMPH_GEN2_3P5DB_Pos           (0U)
#define SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_TX_DEEMPH_GEN2_3P5DB_Msk           (0x3FUL << SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_TX_DEEMPH_GEN2_3P5DB_Pos)            /*!< 0x0000003F */
#define SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_TX_DEEMPH_GEN2_3P5DB               SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_TX_DEEMPH_GEN2_3P5DB_Msk                       /*!< TX De-emphasis at 3 */
#define SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_TX_DEEMPH_GEN2_6DB_Pos             (6U)
#define SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_TX_DEEMPH_GEN2_6DB_Msk             (0x3FUL << SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_TX_DEEMPH_GEN2_6DB_Pos)              /*!< 0x00000FC0 */
#define SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_TX_DEEMPH_GEN2_6DB                 SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_TX_DEEMPH_GEN2_6DB_Msk                         /*!< TX De-emphasis at 6 dB (PCIe gen2 use case) */
#define SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_COMMON_CLOCKS_Pos                  (12U)
#define SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_COMMON_CLOCKS_Msk                  (0x1UL << SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_COMMON_CLOCKS_Pos)                    /*!< 0x00001000 */
#define SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_COMMON_CLOCKS                      SYSCFG_COMBOPHYCR5_COMBOPHY_PCS_COMMON_CLOCKS_Msk                              /*!< Select Common Clock Mode for PCIe Receive Data path */
#define SYSCFG_COMBOPHYCR5_COMBOPHY_LANE0_EXT_PCLK_REQ_Pos                 (13U)
#define SYSCFG_COMBOPHYCR5_COMBOPHY_LANE0_EXT_PCLK_REQ_Msk                 (0x1UL << SYSCFG_COMBOPHYCR5_COMBOPHY_LANE0_EXT_PCLK_REQ_Pos)                   /*!< 0x00002000 */
#define SYSCFG_COMBOPHYCR5_COMBOPHY_LANE0_EXT_PCLK_REQ                     SYSCFG_COMBOPHYCR5_COMBOPHY_LANE0_EXT_PCLK_REQ_Msk                             /*!< USB3 use case: external PIPE clock enable request */
#define SYSCFG_COMBOPHYCR5_COMBOPHY_LANE0_TX2RX_LOOPBK_Pos                 (14U)
#define SYSCFG_COMBOPHYCR5_COMBOPHY_LANE0_TX2RX_LOOPBK_Msk                 (0x1UL << SYSCFG_COMBOPHYCR5_COMBOPHY_LANE0_TX2RX_LOOPBK_Pos)                   /*!< 0x00004000 */
#define SYSCFG_COMBOPHYCR5_COMBOPHY_LANE0_TX2RX_LOOPBK                     SYSCFG_COMBOPHYCR5_COMBOPHY_LANE0_TX2RX_LOOPBK_Msk                             /*!< USB3 use case: when this bit is equal to 1, data from the transmit predriver is looped back to the  */
#define SYSCFG_COMBOPHYCR5_COMBOPHY_PIPE0_TX2RX_LOOPBK_Pos                 (15U)
#define SYSCFG_COMBOPHYCR5_COMBOPHY_PIPE0_TX2RX_LOOPBK_Msk                 (0x1UL << SYSCFG_COMBOPHYCR5_COMBOPHY_PIPE0_TX2RX_LOOPBK_Pos)                   /*!< 0x00008000 */
#define SYSCFG_COMBOPHYCR5_COMBOPHY_PIPE0_TX2RX_LOOPBK                     SYSCFG_COMBOPHYCR5_COMBOPHY_PIPE0_TX2RX_LOOPBK_Msk                             /*!< PCIe use case: when this bit is equal to 1, data from the transmit predriver is looped back to the  */

/**************  Bit definition for SYSCFG_COMBOPHYSR register  ***************/
#define SYSCFG_COMBOPHYSR_COMBOPHY_RTUNE_ACK_Pos                           (0U)
#define SYSCFG_COMBOPHYSR_COMBOPHY_RTUNE_ACK_Msk                           (0x1UL << SYSCFG_COMBOPHYSR_COMBOPHY_RTUNE_ACK_Pos)                             /*!< 0x00000001 */
#define SYSCFG_COMBOPHYSR_COMBOPHY_RTUNE_ACK                               SYSCFG_COMBOPHYSR_COMBOPHY_RTUNE_ACK_Msk                                       /*!< Indicates the end of the termination calibration step */
#define SYSCFG_COMBOPHYSR_COMBOPHY_PIPE0_PHYSTATUS_Pos                     (1U)
#define SYSCFG_COMBOPHYSR_COMBOPHY_PIPE0_PHYSTATUS_Msk                     (0x1UL << SYSCFG_COMBOPHYSR_COMBOPHY_PIPE0_PHYSTATUS_Pos)                       /*!< 0x00000002 */
#define SYSCFG_COMBOPHYSR_COMBOPHY_PIPE0_PHYSTATUS                         SYSCFG_COMBOPHYSR_COMBOPHY_PIPE0_PHYSTATUS_Msk                                 /*!< Communicates completion of several PHY functions: pipe0_pclk is up and stable, power management sta */

/*************  Bit definition for SYSCFG_DISPLAYCLKCR register  **************/
#define SYSCFG_DISPLAYCLKCR_PIXEL_CLK_SEL_Pos                              (0U)
#define SYSCFG_DISPLAYCLKCR_PIXEL_CLK_SEL_Msk                              (0x3UL << SYSCFG_DISPLAYCLKCR_PIXEL_CLK_SEL_Pos)                                /*!< 0x00000003 */
#define SYSCFG_DISPLAYCLKCR_PIXEL_CLK_SEL                                  SYSCFG_DISPLAYCLKCR_PIXEL_CLK_SEL_Msk                                          /*!< Control of pixel clock output selection */

/****************  Bit definition for SYSCFG_PCIECR register  *****************/
#define SYSCFG_PCIECR_APP_INIT_RST_Pos                                     (1U)
#define SYSCFG_PCIECR_APP_INIT_RST_Msk                                     (0x1UL << SYSCFG_PCIECR_APP_INIT_RST_Pos)                                       /*!< 0x00000002 */
#define SYSCFG_PCIECR_APP_INIT_RST                                         SYSCFG_PCIECR_APP_INIT_RST_Msk                                                 /*!< Request from the application to send a Hot Reset to the downstream device */
#define SYSCFG_PCIECR_APP_LTSSM_ENABLE_Pos                                 (2U)
#define SYSCFG_PCIECR_APP_LTSSM_ENABLE_Msk                                 (0x1UL << SYSCFG_PCIECR_APP_LTSSM_ENABLE_Pos)                                   /*!< 0x00000004 */
#define SYSCFG_PCIECR_APP_LTSSM_ENABLE                                     SYSCFG_PCIECR_APP_LTSSM_ENABLE_Msk                                             /*!< After application has finished initializing the core configuration registers, it should assert app_ */
#define SYSCFG_PCIECR_APP_REQ_RETRY_EN_Pos                                 (3U)
#define SYSCFG_PCIECR_APP_REQ_RETRY_EN_Msk                                 (0x1UL << SYSCFG_PCIECR_APP_REQ_RETRY_EN_Pos)                                   /*!< 0x00000008 */
#define SYSCFG_PCIECR_APP_REQ_RETRY_EN                                     SYSCFG_PCIECR_APP_REQ_RETRY_EN_Msk                                             /*!< Provides a capability to defer incoming Configuration Requests until initialization is complete */
#define SYSCFG_PCIECR_SYS_INT_Pos                                          (4U)
#define SYSCFG_PCIECR_SYS_INT_Msk                                          (0x1UL << SYSCFG_PCIECR_SYS_INT_Pos)                                            /*!< 0x00000010 */
#define SYSCFG_PCIECR_SYS_INT                                              SYSCFG_PCIECR_SYS_INT_Msk                                                      /*!< When pcie_sys_int goes from low to high, the core generates an Assert_INTx Message */
#define SYSCFG_PCIECR_DEBUG_BUS_SEL_Pos                                    (5U)
#define SYSCFG_PCIECR_DEBUG_BUS_SEL_Msk                                    (0x3UL << SYSCFG_PCIECR_DEBUG_BUS_SEL_Pos)                                      /*!< 0x00000060 */
#define SYSCFG_PCIECR_DEBUG_BUS_SEL                                        SYSCFG_PCIECR_DEBUG_BUS_SEL_Msk                                                /*!< selection of PCIe observation points */
#define SYSCFG_PCIECR_APP_CLK_REQ_N_Pos                                    (7U)
#define SYSCFG_PCIECR_APP_CLK_REQ_N_Msk                                    (0x1UL << SYSCFG_PCIECR_APP_CLK_REQ_N_Pos)                                      /*!< 0x00000080 */
#define SYSCFG_PCIECR_APP_CLK_REQ_N                                        SYSCFG_PCIECR_APP_CLK_REQ_N_Msk                                                /*!< If the application does not want to remove the reference clock it should set this signal to 0 */
#define SYSCFG_PCIECR_DEVICE_TYPE_Pos                                      (8U)
#define SYSCFG_PCIECR_DEVICE_TYPE_Msk                                      (0xFUL << SYSCFG_PCIECR_DEVICE_TYPE_Pos)                                        /*!< 0x00000F00 */
#define SYSCFG_PCIECR_DEVICE_TYPE                                          SYSCFG_PCIECR_DEVICE_TYPE_Msk                                                  /*!< Device/port type */
#define SYSCFG_PCIECR_APP_DEV_NUM_Pos                                      (12U)
#define SYSCFG_PCIECR_APP_DEV_NUM_Msk                                      (0x1FUL << SYSCFG_PCIECR_APP_DEV_NUM_Pos)                                       /*!< 0x0001F000 */
#define SYSCFG_PCIECR_APP_DEV_NUM                                          SYSCFG_PCIECR_APP_DEV_NUM_Msk                                                  /*!< The device number in the Requester ID for an RC port */
#define SYSCFG_PCIECR_APP_BUS_NUM_Pos                                      (17U)
#define SYSCFG_PCIECR_APP_BUS_NUM_Msk                                      (0xFFUL << SYSCFG_PCIECR_APP_BUS_NUM_Pos)                                       /*!< 0x01FE0000 */
#define SYSCFG_PCIECR_APP_BUS_NUM                                          SYSCFG_PCIECR_APP_BUS_NUM_Msk                                                  /*!< The bus number in the Requester ID for RC port */
#define SYSCFG_PCIECR_APP_DBI_RO_WR_DISABLE_Pos                            (25U)
#define SYSCFG_PCIECR_APP_DBI_RO_WR_DISABLE_Msk                            (0x1UL << SYSCFG_PCIECR_APP_DBI_RO_WR_DISABLE_Pos)                              /*!< 0x02000000 */
#define SYSCFG_PCIECR_APP_DBI_RO_WR_DISABLE                                SYSCFG_PCIECR_APP_DBI_RO_WR_DISABLE_Msk                                        /*!< DBI Read-only Write Disable */

/*************  Bit definition for SYSCFG_PCIEPMEMSICR register  **************/
#define SYSCFG_PCIEPMEMSICR_RST_CFG_PME_MSI_INT_Pos                        (0U)
#define SYSCFG_PCIEPMEMSICR_RST_CFG_PME_MSI_INT_Msk                        (0x1UL << SYSCFG_PCIEPMEMSICR_RST_CFG_PME_MSI_INT_Pos)                          /*!< 0x00000001 */
#define SYSCFG_PCIEPMEMSICR_RST_CFG_PME_MSI_INT                            SYSCFG_PCIEPMEMSICR_RST_CFG_PME_MSI_INT_Msk                                    /*!< Reset the pcie_cfg_pme_msi interrupt logic */

/************  Bit definition for SYSCFG_PCIEAERRCMSICR register  *************/
#define SYSCFG_PCIEAERRCMSICR_RST_CFG_AER_RC_ERR_MSI_INT_Pos               (0U)
#define SYSCFG_PCIEAERRCMSICR_RST_CFG_AER_RC_ERR_MSI_INT_Msk               (0x1UL << SYSCFG_PCIEAERRCMSICR_RST_CFG_AER_RC_ERR_MSI_INT_Pos)                 /*!< 0x00000001 */
#define SYSCFG_PCIEAERRCMSICR_RST_CFG_AER_RC_ERR_MSI_INT                   SYSCFG_PCIEAERRCMSICR_RST_CFG_AER_RC_ERR_MSI_INT_Msk                           /*!< Reset the pcie_cfg_aer_rc_err_msi interrupt logic */

/**************  Bit definition for SYSCFG_PCIESYSRCCR register  **************/
#define SYSCFG_PCIESYSRCCR_RST_CFG_SYS_ERR_RC_INT_Pos                      (0U)
#define SYSCFG_PCIESYSRCCR_RST_CFG_SYS_ERR_RC_INT_Msk                      (0x1UL << SYSCFG_PCIESYSRCCR_RST_CFG_SYS_ERR_RC_INT_Pos)                        /*!< 0x00000001 */
#define SYSCFG_PCIESYSRCCR_RST_CFG_SYS_ERR_RC_INT                          SYSCFG_PCIESYSRCCR_RST_CFG_SYS_ERR_RC_INT_Msk                                  /*!< Reset the pcie_cfg_sys_err_rc interrupt logic */
#define SYSCFG_PCIESYSRCCR_RST_CFG_LINK_AUTO_BW_MSI_INT_Pos                (1U)
#define SYSCFG_PCIESYSRCCR_RST_CFG_LINK_AUTO_BW_MSI_INT_Msk                (0x1UL << SYSCFG_PCIESYSRCCR_RST_CFG_LINK_AUTO_BW_MSI_INT_Pos)                  /*!< 0x00000002 */
#define SYSCFG_PCIESYSRCCR_RST_CFG_LINK_AUTO_BW_MSI_INT                    SYSCFG_PCIESYSRCCR_RST_CFG_LINK_AUTO_BW_MSI_INT_Msk                            /*!< Reset the cfg_link_auto_bw_msi interrupt logic */
#define SYSCFG_PCIESYSRCCR_RST_CFG_BW_MGT_MSI_INT_Pos                      (2U)
#define SYSCFG_PCIESYSRCCR_RST_CFG_BW_MGT_MSI_INT_Msk                      (0x1UL << SYSCFG_PCIESYSRCCR_RST_CFG_BW_MGT_MSI_INT_Pos)                        /*!< 0x00000004 */
#define SYSCFG_PCIESYSRCCR_RST_CFG_BW_MGT_MSI_INT                          SYSCFG_PCIESYSRCCR_RST_CFG_BW_MGT_MSI_INT_Msk                                  /*!< Reset the cfg_bw_mgt_msi interrupt logic */
#define SYSCFG_PCIESYSRCCR_RST_RADM_QOVERFLOW_Pos                          (31U)
#define SYSCFG_PCIESYSRCCR_RST_RADM_QOVERFLOW_Msk                          (0x1UL << SYSCFG_PCIESYSRCCR_RST_RADM_QOVERFLOW_Pos)                            /*!< 0x80000000 */
#define SYSCFG_PCIESYSRCCR_RST_RADM_QOVERFLOW                              SYSCFG_PCIESYSRCCR_RST_RADM_QOVERFLOW_Msk                                      /*!< Reset the radm_qoverflow interrupt logic */

/*************  Bit definition for SYSCFG_PCIEPTMIRQCR register  **************/
#define SYSCFG_PCIEPTMIRQCR_RST_PTM_CLOCK_UPDATED_Pos                      (0U)
#define SYSCFG_PCIEPTMIRQCR_RST_PTM_CLOCK_UPDATED_Msk                      (0x1UL << SYSCFG_PCIEPTMIRQCR_RST_PTM_CLOCK_UPDATED_Pos)                        /*!< 0x00000001 */
#define SYSCFG_PCIEPTMIRQCR_RST_PTM_CLOCK_UPDATED                          SYSCFG_PCIEPTMIRQCR_RST_PTM_CLOCK_UPDATED_Msk                                  /*!< Reset the ptm_clock_updated interrupt logic */
#define SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_RESPONSE_TIMEOUT_Pos               (1U)
#define SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_RESPONSE_TIMEOUT_Msk               (0x1UL << SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_RESPONSE_TIMEOUT_Pos)                 /*!< 0x00000002 */
#define SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_RESPONSE_TIMEOUT                   SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_RESPONSE_TIMEOUT_Msk                           /*!< Reset the ptm_req_response_timeout interrupt logic */
#define SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_DUP_RX_Pos                         (2U)
#define SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_DUP_RX_Msk                         (0x1UL << SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_DUP_RX_Pos)                           /*!< 0x00000004 */
#define SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_DUP_RX                             SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_DUP_RX_Msk                                     /*!< Reset the ptm_req_dup_rx interrupt logic */
#define SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_REPLAY_TX_Pos                      (3U)
#define SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_REPLAY_TX_Msk                      (0x1UL << SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_REPLAY_TX_Pos)                        /*!< 0x00000008 */
#define SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_REPLAY_TX                          SYSCFG_PCIEPTMIRQCR_RST_PTM_REQ_REPLAY_TX_Msk                                  /*!< Reset the ptm_req_replay_rx interrupt logic */

